import streamlit as st

st.markdown("""
**Начало работы с сайтом: Импорт CSV файла с ИНН**

Чтобы воспользоваться функционалом нашего сайта, вам потребуется CSV файл, содержащий колонку с ИНН участников рынка закупок, для сравнительного анализа и системы ранжирования. Вот пошаговая инструкция по импорту и использованию файла:

**Шаг 1: Подготовка CSV файла**

Убедитесь, что ваш CSV файл содержит колонку с названием "inn", где указаны ИНН участников рынка закупок, которых вы хотите проанализировать.

**Шаг 2: Загрузка файла на сайт (для сравнительного анализа и системы ранжирования)**

1. Найдите кнопку "Загрузить файл" или "Выбрать файл" на странице сравнительного анализа или системы ранжирования.
2. Нажмите на кнопку и выберите подготовленный CSV файл на вашем компьютере.

**Шаг 3: Анализ данных**

После успешной загрузки файла (если требуется), сайт автоматически обработает данные и предоставит вам результаты анализа:
- Для анализа одного участника: введите ИНН интересующей компании и получите подробную информацию о ней.
- Для сравнительного анализа: загрузите список ИНН и сравните участников по ключевым показателям.
- Для системы ранжирования: разместите список ИНН и получите отранжированный список контрагентов в порядке убывания репутации.

**Шаг 4: Использование результатов**

Используйте полученную информацию для принятия обоснованных решений о выборе контрагентов, планировании сотрудничества и оптимизации вашего бизнеса.

*Надеемся, что эта инструкция поможет вам эффективно пользоваться нашим сайтом. Удачи вам в анализе и развитии вашего бизнеса!*
""")